{
  "storyId": "b364f6e4-3e9b-47ff-b6b1-7b908116e1df",
  "userId": "K33FGSDBQVMBSA7TljJbGKF6p1p1",
  "title": "mariam and her kitty",
  "dedication": "to my granddaughter",
  "recipient": {
    "name": "mariam",
    "relationship": "grand daughter",
    "age": "2",
    "occasion": "Other",
    "customOccasion": "losing her kitty"
  },
  "character": {
    "mainCharacter": "girl",
    "characterName": "mariam",
    "age": "2",
    "skinTone": "Light",
    "hairColor": "Brown",
    "accessories": "a small red scarf"
  },
  "storyDescription": "mariam loves albas . she feeds him and run after him in the backyard .albas sleeps next to mariam . suddenly he bacame sick .does not sleep .then he passed away . maraim now is sad .she keeps calling for albas but he never comes back. ",
  "numPages": "6",
  "generatedStory": [
    "Once upon a time, in a bright and cheerful little house, lived a sweet child named Mariam. Mariam was a two-year-old girl with light skin, playful brown hair, and she always wore a small red scarf. She had a special friend, a",
    "kitty named Albas, whom she loved dearly. Every day, Mariam would feed Albas his favourite sardines, and they would play in the backyard, chasing butterflies and the afternoon sun. At night, Albas would curl up and fall asleep next to Mariam, purring",
    "softly. This was their special routine, full of laughter, love, and joyful games. One day, Albas became sick. He didn't want to eat his sardines, or play in the backyard, and he couldn't sleep at night. Mariam was worried and gave Albas",
    "warm cuddles, hoping he'd get better. Sadly, Albas didn't get better. One morning, Albas did not wake up. Mariam called for Albas, she searched in his usual hiding spots, but Albas did not come. This made Mariam very sad, she missed her",
    "friend. However, Mariam's grandpa comforted her saying that Albas was now playing in the evergreen meadows of Kitty heaven. With time, Mariam understood that Albas wouldn't come back, but she would remember their beautiful moments together. She started to smile again when",
    "she thought about Albas, knowing he was happy in Kitty heaven. This made her heart a little lighter. While Albas would be missed, Mariam knew that the love they shared was forever alive in her heart. The end."
  ],
  "imageUrls": [
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/b364f6e4-3e9b-47ff-b6b1-7b908116e1df/img0.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/b364f6e4-3e9b-47ff-b6b1-7b908116e1df/img1.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/b364f6e4-3e9b-47ff-b6b1-7b908116e1df/img2.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/b364f6e4-3e9b-47ff-b6b1-7b908116e1df/img3.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/b364f6e4-3e9b-47ff-b6b1-7b908116e1df/img4.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/b364f6e4-3e9b-47ff-b6b1-7b908116e1df/img5.png"
  ],
  "timestamp": "2025-06-11T17:31:41.264Z"
}