{
  "storyId": "aa438364-cbb4-486f-8285-3b09aa0a429b",
  "userId": "K33FGSDBQVMBSA7TljJbGKF6p1p1",
  "title": "Milo the Brave Bear",
  "dedication": "To my little hero",
  "recipient": {
    "name": "Nour",
    "relationship": "sibling",
    "age": "5",
    "occasion": "Graduation",
    "customOccasion": ""
  },
  "character": {
    "mainCharacter": "animal",
    "characterName": "Milo",
    "age": "5",
    "skinTone": "Soft brown fur with white patches",
    "hairColor": "no",
    "accessories": "a small red scarf"
  },
  "storyDescription": "In the peaceful Pine Forest lived a small bear named Milo who was scared of loud sounds. One day, a strong wind blew through the forest, making trees creak and animals panic. Milo wanted to hide, but instead, he put on his red scarf and decided to help. He guided the little animals to safety and showed everyone that courage means helping others even when you're afraid.",
  "numPages": "3",
  "generatedStory": [
    "Page 1:\nPage 1: In the heart of Pine Forest lived a small bear named Milo. Milo was often scared, especially of loud sounds, but he had a big, brave heart. Unlike other times, Milo decided not to hide away. Page 3: Despite the scary noises, Milo chose to help. He comforted a crying fox, telling her not to fear, inspiring courage in all.",
    "Page 2:\nPage 4: Milo was a hero. He showed everyone that fear should not hold you back, but it should lead you forward. Page 5: Milo, the Brave Bear, continued to live in Pine Forest, his soft brown fur and white patches shining brighter than ever. They knew Milo, with his little red scarf, was there to save the day. It’s about being",
    "Page 3:\nscared and still stepping up. Page 7: So, next time you feel scared like Milo, remember his bravery. Just like Milo, you can be brave, you can be a hero too. The red scarf still wrapped around his neck, a symbol of bravery. Page 9: A little hero for everyone who reads his story – just like you, Nour. Brave and ready."
  ],
  "imageUrls": [
    null,
    null,
    null
  ],
  "timestamp": "2025-04-24T19:03:56.344Z"
}