{
  "storyId": "199279df-af3a-4af7-afc7-08802f9267af",
  "userId": "K33FGSDBQVMBSA7TljJbGKF6p1p1",
  "title": "graduation project",
  "dedication": "to my doctors",
  "recipient": {
    "name": "razan&aya",
    "relationship": "Best Friend",
    "age": "22",
    "occasion": "Graduation",
    "customOccasion": ""
  },
  "character": {
    "mainCharacter": "girl",
    "characterName": "mais",
    "age": "22",
    "skinTone": "Light",
    "hairColor": "no",
    "accessories": "no"
  },
  "storyDescription": "the story is about 2 students who have accomplished their graduation project and they are stressed about the discussion of the project to present their work and they hope everything will end fine.",
  "numPages": "10",
  "generatedStory": [
    "Once upon a time, in a land filled with knowledge and curiosity, there lived two best friends, Mais and Razan. They were both clever and always looking for opportunities to learn new things. They studied hard in a university, dreaming of becoming successful",
    "doctors. One day, a very special and important project was announced - the Graduation Project! Mais and Razan, both excited and nervous, took the opportunity to prove their skills. They put their hearts and minds into preparing the best project they could. They",
    "spent hours doing research, making models, and perfecting their presentation under the guidance of their trusted professors. After days of hard work, the project was finally ready. It was a masterpiece that reflected their dedication and determination. However, they had one more challenge",
    "to overcome - the presentation. For this was not just any presentation. It represented years of effort. They would be graded on the project's importance, the clarity of their explanations, and the team's overall understanding. For days, Mais and Razan would rehearse tirelessly.",
    "They would stay up late in the library, going over each detail meticulously, hoping everything would end fine. Occasionally, their resolve would waver. However, every time they felt discouraged, they remembered their dreams of becoming doctors. Finally, the day of the presentation arrived.",
    "Their hearts pounded as they presented their project. Every diagram was explained, every question answered wisely. The room filled with applause when they finished speaking. Waiting for the results seemed like an eternity. They knew they had done the best they could but",
    "still felt the pressure. The moment arrived! The dean stood tall on the stage and announced, “The winners of the Graduation Project are… Mais and Razan!\" The room filled with cheers and applause once again. Tears streamed down their faces as they accepted",
    "the award. They had done it! Their hard work and dedication had paid off. Despite the stress and fear, their belief in themselves had led them to succeed. From then on, whenever someone talks about the Graduation Project, the names Mais and Razan",
    "shine the brightest. And today, they stand as successful doctors, always reminding everyone that no matter how big the obstacle, with determination and faith, it can be overcome. So dear Razan and Aya, let this tale remind you of your magnificent journey. You",
    "are the heroes of this story, the brave warriors who fought fear and stress to achieve the extraordinary. Let this memory of yours inspire many more to do great things. Congratulations on your graduation!"
  ],
  "imageUrls": [
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img0.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img1.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img2.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img3.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img4.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img5.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img6.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img7.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img8.png",
    "/images/K33FGSDBQVMBSA7TljJbGKF6p1p1/199279df-af3a-4af7-afc7-08802f9267af/img9.png"
  ],
  "timestamp": "2025-06-10T21:07:07.730Z"
}